In [1]:
import pandas as pd

In [3]:
import matplotlib.pyplot as plt

In [5]:
import seaborn as sns

In [13]:
val=[('2024-01-15', 'Product A', 'Electronics', 'North', 150.00),
('2024-02-20', 'Product B', 'Furniture', 'South', 300.00),
('2024-03-10', 'Product C', 'Electronics', 'East', 200.00),
('2024-04-05', 'Product D', 'Furniture', 'West', 250.00),
('2024-05-25', 'Product E', 'Clothing', 'North', 100.00),
('2024-06-30', 'Product F', 'Clothing', 'South', 75.00),
('2024-07-15', 'Product G', 'Electronics', 'East', 180.00),
('2024-08-20', 'Product H', 'Furniture', 'West', 220.00),
('2024-09-10', 'Product I', 'Clothing', 'North', 90.00),
('2024-10-05', 'Product J', 'Electronics', 'South', 130.00),
('2024-11-25', 'Product K', 'Furniture', 'East', 310.00),
('2024-12-30', 'Product L', 'Clothing', 'West', 140.00)]

df=pd.DataFrame(val,columns=["sale_date", "product", "category", "region", "sales_amount"])

In [11]:
df

     sale_date    product     category region  sales_amount
0   2024-01-15  Product A  Electronics  North         150.0
1   2024-02-20  Product B    Furniture  South         300.0
2   2024-03-10  Product C  Electronics   East         200.0
3   2024-04-05  Product D    Furniture   West         250.0
4   2024-05-25  Product E     Clothing  North         100.0
5   2024-06-30  Product F     Clothing  South          75.0
6   2024-07-15  Product G  Electronics   East         180.0
7   2024-08-20  Product H    Furniture   West         220.0
8   2024-09-10  Product I     Clothing  North          90.0
9   2024-10-05  Product J  Electronics  South         130.0
10  2024-11-25  Product K    Furniture   East         310.0
11  2024-12-30  Product L     Clothing   West         140.0

In [20]:
grouped_quar=df.groupby(df.region)

In [22]:
df_north=grouped_quar.get_group("North")

In [24]:
df_north

    sale_date    product     category region  sales_amount
0  2024-01-15  Product A  Electronics  North         150.0
4  2024-05-25  Product E     Clothing  North         100.0
8  2024-09-10  Product I     Clothing  North          90.0

In [26]:
df_south=grouped_quar.get_group("South")

In [28]:
df_south

    sale_date    product     category region  sales_amount
1  2024-02-20  Product B    Furniture  South         300.0
5  2024-06-30  Product F     Clothing  South          75.0
9  2024-10-05  Product J  Electronics  South         130.0

In [30]:
df_west=grouped_quar.get_group("West")

In [32]:
df_west

     sale_date    product   category region  sales_amount
3   2024-04-05  Product D  Furniture   West         250.0
7   2024-08-20  Product H  Furniture   West         220.0
11  2024-12-30  Product L   Clothing   West         140.0

In [34]:
df_east=grouped_quar.get_group("East")

In [36]:
df_east

     sale_date    product     category region  sales_amount
2   2024-03-10  Product C  Electronics   East         200.0
6   2024-07-15  Product G  Electronics   East         180.0
10  2024-11-25  Product K    Furniture   East         310.0

In [38]:
data1={
    "Region":["North","South","West","East"],
    "Total_sales":[df_north['sales_amount'].sum(),df_south['sales_amount'].sum(),df_west['sales_amount'].sum(),df_east['sales_amount'].sum(),]
}

In [40]:
one=pd.DataFrame(data1)

In [42]:
one

  Region  Total_sales
0  North        340.0
1  South        505.0
2   West        610.0
3   East        690.0

In [54]:
##############2#######################

In [64]:
nor_ele=0
nor_clo=0
nor_fur=0

for i in df_north.index:
    if df.loc[i].category=="Electronics":
        nor_ele=df.loc[i].sales_amount.count()
    elif df.loc[i].category=="Clothing":
        nor_clo=df.loc[i].sales_amount.count()
    elif df.loc[i].category=="Furniture":
        nor_fur=df.loc[i].sales_amount.count()

In [74]:
data2={
    "Region":["North","North","North"],
    "Category":["Electronics","Clothing","Furniture"],
    "Count":[nor_ele,nor_clo,nor_clo]
}
two=pd.DataFrame(data2)

In [78]:
two

  Region     Category  Count
0  North  Electronics  150.0
1  North     Clothing  190.0
2  North    Furniture  190.0